In [23]:
import pandas as pd

In [24]:
pd.__version__

'2.0.3'

In [25]:
from sqlalchemy import create_engine

In [26]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [27]:
engine.connect()

In [28]:
df = pd.read_csv('green_tripdata_2019-10.csv',nrows=100)

In [29]:
df

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2,2019-10-01 00:26:02,2019-10-01 00:39:58,N,1,112,196,1,5.88,18.0,0.50,0.5,0.00,0.0,NaN,0.3,19.30,2,1,0.0
1,1,2019-10-01 00:18:11,2019-10-01 00:22:38,N,1,43,263,1,0.80,5.0,3.25,0.5,0.00,0.0,NaN,0.3,9.05,2,1,0.0
2,1,2019-10-01 00:09:31,2019-10-01 00:24:47,N,1,255,228,2,7.50,21.5,0.50,0.5,0.00,0.0,NaN,0.3,22.80,2,1,0.0
3,1,2019-10-01 00:37:40,2019-10-01 00:41:49,N,1,181,181,1,0.90,5.5,0.50,0.5,0.00,0.0,NaN,0.3,6.80,2,1,0.0
4,2,2019-10-01 00:08:13,2019-10-01 00:17:56,N,1,97,188,1,2.52,10.0,0.50,0.5,2.26,0.0,NaN,0.3,13.56,1,1,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,2,2019-10-01 00:02:53,2019-10-01 00:14:32,N,1,126,74,1,3.10,12.0,0.50,0.5,0.00,0.0,NaN,0.3,13.30,1,1,0.0
96,2,2019-10-01 00:18:45,2019-10-01 00:29:23,N,1,42,74,1,1.64,9.5,0.50,0.5,0.00,0.0,NaN,0.3,10.80,2,1,0.0
97,2,2019-10-01 00:41:32,2019-10-01 00:52:51,N,1,75,42,1,3.17,11.5,0.50,0.5,1.50,0.0,NaN,0.3,14.30,1,1,0.0
98,2,2019-10-01 00:36:54,2019-10-01 00:54:20,N,1,92,179,1,5.48,19.5,0.50,0.5,0.00,0.0,NaN,0.3,20.80,2,1,0.0
99,2,2019-10-01 00:21:27,2019-10-01 00:26:59,N,1,129,129,1,1.02,6.0,0.50,0.5,0.00,0.0,NaN,0.3,7.30,2,1,0.0

In [30]:
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

In [31]:
print(pd.io.sql.get_schema(df, name='yellow_taxi_data',con=engine))

CREATE TABLE yellow_taxi_data (
	"VendorID" BIGINT,
	lpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	lpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	store_and_fwd_flag TEXT,
	"RatecodeID" BIGINT,
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	passenger_count BIGINT,
	trip_distance FLOAT(53),
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	ehail_fee FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	payment_type BIGINT,
	trip_type BIGINT,
	congestion_surcharge FLOAT(53)
)

In [32]:
df_iter = pd.read_csv('green_tripdata_2019-10.csv',iterator=True,chunksize=100000, low_memory=False)

In [33]:
from time import time

In [34]:
print("start")
while True: 
    t_start = time()
    df =  next(df_iter)
    df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
    df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)
    print("input")
    df.to_sql(name='green_taxi_data', con=engine, if_exists='append')
    t_end = time()

    print('inserted another chunk...., took %.3f seconds'%(t_end-t_start))
    if len(df) < 100000:
        break
print("finish")

start
input
inserted another chunk...., took 13.861 seconds
input
inserted another chunk...., took 10.738 seconds
input
inserted another chunk...., took 12.679 seconds
input
inserted another chunk...., took 11.404 seconds
input
inserted another chunk...., took 7.347 seconds
finish

In [100]:
df_segment = pd.read_csv("taxi_zone_lookup.csv")

In [102]:
df_segment.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [105]:
df_segment.to_sql(name='zones', con=engine, if_exists='replace')

265

In [17]:
query = """
SELECT * FROM green_taxi_data LIMIT 10
"""

pd.read_sql(query, con=engine)

,index,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,...,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,100000,2,2019-10-08 15:30:23,2019-10-08 15:37:34,N,1,65,66,1,0.95,...,0.0,0.5,2.19,0.0,None,0.3,9.49,1,1,0.00
1,100001,2,2019-10-08 15:17:48,2019-10-08 15:26:33,N,1,226,260,1,1.69,...,0.0,0.5,1.20,0.0,None,0.3,10.00,1,1,0.00
2,100002,2,2019-10-08 16:01:41,2019-10-08 16:29:08,N,1,226,161,1,3.41,...,0.0,0.5,4.31,0.0,None,0.3,25.86,1,1,2.75
3,100003,1,2019-10-08 15:54:49,2019-10-08 15:59:37,N,1,181,181,1,0.60,...,1.0,0.5,0.00,0.0,None,0.3,6.80,2,1,0.00
4,100004,2,2019-10-08 15:14:39,2019-10-08 15:30:24,N,1,179,223,1,1.20,...,0.0,0.5,0.00,0.0,None,0.3,11.30,2,1,0.00
5,100005,2,2019-10-08 15:16:59,2019-10-08 15:40:56,N,1,166,237,1,3.30,...,0.0,0.5,4.11,0.0,None,0.3,24.66,1,1,2.75
6,100006,2,2019-10-08 15:29:21,2019-10-08 15:42:11,N,1,97,225,1,2.12,...,0.0,0.5,0.00,0.0,None,0.3,11.30,1,1,0.00
7,100007,2,2019-10-08 15:22:37,2019-10-08 15:33:22,N,1,75,74,1,1.43,...,0.0,0.5,1.00,0.0,None,0.3,10.30,1,1,0.00
8,100008,2,2019-10-08 15:21:24,2019-10-08 15:35:25,N,1,76,76,1,2.41,...,0.0,0.5,0.00,0.0,None,0.3,12.80,1,1,0.00
9,100009,2,2019-10-08 15:32:53,2019-10-08 15:42:00,N,1,75,75,2,1.20,...,0.0,0.5,1.66,0.0,None,0.3,9.96,1,1,0.00

In [ ]:
## answer for number 3

In [36]:
query = """
select 
	sum(case when trip_distance <= 1 then 1 else 0 end) as "up_to_1_miles",
	sum(case when trip_distance > 1 and trip_distance <= 3 then 1 else 0 end) as between_1_to_3,
	sum(case when trip_distance > 3 and trip_distance <= 7 then 1 else 0 end) as between_3_to_7,
	sum(case when trip_distance > 7 and trip_distance <= 10 then 1 else 0 end) as between_7_to_10,
	sum(case when trip_distance > 10 then 1 else 0 end) as more_than_10
from 
	green_taxi_data
"""
pd.read_sql(query, con=engine)

,up_to_1_miles,between_1_to_3,between_3_to_7,between_7_to_10,more_than_10
0,104838,199013,109645,27688,35202

In [37]:
##no 4 sql

In [39]:
query = """
select 
	date(lpep_pickup_datetime),
	trip_distance
from 
	green_taxi_data
where 
	lpep_pickup_datetime >= '2019-10-01'
	And
	lpep_pickup_datetime < '2019-11-01'
ORDER BY trip_distance desc
limit 5
"""
pd.read_sql(query, con=engine)

         date  trip_distance
0  2019-10-31         515.89
1  2019-10-11          95.78
2  2019-10-26          91.56
3  2019-10-24          90.75
4  2019-10-05          85.23

In [40]:
##no 5

In [42]:
query = """
select 
	zpu."Zone" as PUZone,
	count(zpu."Zone") as total_trip
from 
	green_taxi_data as t 
	join zones as zpu 
	on t."PULocationID" = zpu."LocationID"
where 
	date(lpep_pickup_datetime) = '2019-10-18'
Group by PUZone
order by total_trip desc
limit 3
"""
pd.read_sql(query, con=engine)

              puzone  total_trip
0  East Harlem North        1236
1  East Harlem South        1101
2     Central Harlem         931

In [43]:
## no 6

In [45]:
query = """
select 
	zpu."Zone" as PUZone,
	zdo."Zone" as DOZone,
	tip_amount
from 
	yellow_taxi_trips as t 
	join zones as zpu 
	on t."PULocationID" = zpu."LocationID"
	join zones as zdo on 	t."DOLocationID" = zdo."LocationID"
Where  zpu."Zone" = 'East Harlem North' and 
	lpep_pickup_datetime >= '2019-10-01'
	And
	lpep_pickup_datetime < '2019-11-01'
ORDER BY tip_amount desc
limit 1
"""
pd.read_sql(query, con=engine)

              puzone       dozone  tip_amount
0  East Harlem North  JFK Airport        87.3